export const regexp = /^(0[1-9]|1\d|2\d|3[01])-(0[1-9]|1[0-2])-(19|20)\d{2}$/;
export const regOne = /^[234567890]1$/;
export const regTwo = /^[023456789][2-4]$/;
export const regIp = /(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)/;

export const dictionary = {
  rusDays: ['день', 'дня', 'дней'],
  rusHours: ['час', 'часа', 'часов'],
  rusMinutes: ['минута', 'минуты', 'минут'],
  rusSeconds: ['секунда', 'секунды', 'секунд'],
  rusWin: ['выигрыш', 'выигрыша', 'выигрышей'],
  rusLoose: ['проигрыш', 'проигрыша', 'проигрышей'],
};
